students = [
    "วัชสัณห์ วชิรพันธุ์",
    "ณภัทร เลาหโสภณ",
    "ชาลี สิริกชกร",
    "วุฒิภัทร พุ่มแจ้ง",
    "ธนภัทร เผือกวัฒนะ",
    "ศรุต สหวิชญกุล",
    "ธนวัตน์ มงคลศิลป์",
    "ธีรโชติ รุ่งเรือง",
    "ธีร์ธวัช ขุนไกรวงษ์",
    "ภัทรพัฒน์ หลีกภัย",
    "พุฒิเมธ จันทร์ชู",
    "วชิรวิทย์ พิบูลย์สวัสดิ์",
    "ธัชกร ตรีเมธา",
    "วสุรมย์ บุญประกอบ",
    "ชานนท์ ไม้จันทร์",
    "ธนภัทร บุญโสม",
    "วชิรวิทย์ บุญประเทือง",
    "อธินันท์ ถนอมทรัพย์",
    "ภูเมศ จิตรอารี",
    "พยนต์ธร เกิดจั่น",
    "จิรพัส รุ่งทิวาพรชัย",
    "ธานบุญ งามธุระ",
    "สุเมษ อูปาทยาย",
    "ธนวัฒน์ ทองมหา",
    "บุษกร วันทอง",
    "พิชญาพร เจนจบเขต",
    "ทิฆัมพร จงศรีวัฒนพร",
    "ปัทมาพร เวียงเกตุ",
    "สรัลชนา ณ สงขลา",
    "สุฑาวัลย์ สิทธิบวรสกุล",
    "ฐิติรัตน์ นพนราทิพย์",
    "ญาณิศา รักร้อย",
    "บงกชชมพู โสภะ",
    "กฤชอร จันทชำนิ",
    "ปันธิตา อารมย์อุ่น",
    "วาทิณี สีรุ่ง",
    "ภัทร์ฐิตา อภิโชตินวนันท์",
    "วิชญาพร อุ่นใจ",
    "แพรวา ปานอุทัย",
    "โยศิญา ช้างแจ้ง"
]

my_name = "ภัทรพัฒน์ หลีกภัย"

for student in students:
    if student != my_name:
        print(student)
